ssenja/TMM737/BSP/GD32H7xx_HAL/SRC/gd32h73x_75x_rcu.c
        /* PLL clock source selection, HXTAL or IRC64MDIV */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        cksys_freq = rcu_pll_clock_freq_cal(ck_src, pll0psc, pll0n, fracn, pll0p);
        break;
    /* IRC64MDIV is selected as CK_SYS */
    default:
        cksys_freq = irc64mdiv_freq;
        break;
    }

    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    ahb_freq = cksys_freq >> clk_exp;

    /* calculate APB1 clock frequency */
    idx = GET_BITS(RCU_CFG0, 10, 12);
    clk_exp = apb1_exp[idx];
    apb1_freq = ahb_freq >> clk_exp;

    /* calculate APB2 clock frequency */
    idx = GET_BITS(RCU_CFG0, 13, 15);
    clk_exp = apb2_exp[idx];
    apb2_freq = ahb_freq >> clk_exp;

    /* calculate APB3 clock frequency */
    idx = GET_BITS(RCU_CFG0, 27, 29);
    clk_exp = apb3_exp[idx];
    apb3_freq = ahb_freq >> clk_exp;

    /* calculate APB4 clock frequency */
    idx = GET_BITS(RCU_CFG0, 24, 26);
    clk_exp = apb4_exp[idx];
    apb4_freq = ahb_freq >> clk_exp;

    /* return the clocks frequency */
    switch(clock) {
    case CK_SYS:
        ck_freq = cksys_freq;
        break;
    case CK_AHB:
        ck_freq = ahb_freq;
        break;
    case CK_APB1:
        ck_freq = apb1_freq;
        break;
    case CK_APB2:
        ck_freq = apb2_freq;
        break;
    case CK_APB3:
        ck_freq = apb3_freq;
        break;
    case CK_APB4:
        ck_freq = apb4_freq;
        break;
    case CK_PLL0P:
        pll0p_freq = 0U;
        /* calculate pllp clock frequency */
        pll0psc = GET_BITS(RCU_PLL0, 0U, 5U);
        pll0n = (GET_BITS(RCU_PLL0, 6U, 14U) + 1U);
        pll0p = (GET_BITS(RCU_PLL0, 16U, 22U) + 1U);

        if((RCU_PLL0FRA & RCU_PLL0FRA_PLL0FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL0FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll0psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL0PEN) != 0U) {
                pll0p_freq = rcu_pll_clock_freq_cal(ck_src, pll0psc, pll0n, fracn, pll0p);
            }
        }

        ck_freq = pll0p_freq;
        break;
    case CK_PLL0R:
        pll0r_freq = 0U;
        /* calculate pllr clock frequency */
        pll0psc = GET_BITS(RCU_PLL0, 0U, 5U);
        pll0n = (GET_BITS(RCU_PLL0, 6U, 14U) + 1U);
        pll0r = (GET_BITS(RCU_PLL0, 24U, 30U) + 1U);

        if((RCU_PLL0FRA & RCU_PLL0FRA_PLL0FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL0FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll0psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL0REN) != 0U) {
                pll0r_freq = rcu_pll_clock_freq_cal(ck_src, pll0psc, pll0n, fracn, pll0r);
            }
        }

        ck_freq = pll0r_freq;
        break;
    case CK_PLL0Q:
        pll0q_freq = 0U;
        /* calculate pllq clock frequency */
        pll0psc = GET_BITS(RCU_PLL0, 0U, 5U);
        pll0n = (GET_BITS(RCU_PLL0, 6U, 14U) + 1U);
        pll0q = (GET_BITS(RCU_PLLADDCTL, 0U, 6U) + 1U);

        if((RCU_PLL0FRA & RCU_PLL0FRA_PLL0FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL0FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll0psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL0QEN) != 0U) {
                pll0q_freq = rcu_pll_clock_freq_cal(ck_src, pll0psc, pll0n, fracn, pll0q);
            }
        }

        ck_freq = pll0q_freq;
        break;
    case CK_PLL1P:
        pll1p_freq = 0U;
        /* calculate pll1p clock frequency */
        pll1psc = GET_BITS(RCU_PLL1, 0U, 5U);
        pll1n = (GET_BITS(RCU_PLL1, 6U, 14U) + 1U);
        pll1p = (GET_BITS(RCU_PLL1, 16U, 22U) + 1U);

        if((RCU_PLL1FRA & RCU_PLL1FRA_PLL1FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL1FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll1psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL1PEN) != 0U) {
                pll1p_freq = rcu_pll_clock_freq_cal(ck_src, pll1psc, pll1n, fracn, pll1p);
            }
        }

        ck_freq = pll1p_freq;
        break;
    case CK_PLL1R:
        pll1r_freq = 0U;
        /* calculate pll1r clock frequency */
        pll1psc = GET_BITS(RCU_PLL1, 0U, 5U);
        pll1n = (GET_BITS(RCU_PLL1, 6U, 14U) + 1U);
        pll1r = (GET_BITS(RCU_PLL1, 24U, 30U) + 1U);

        if((RCU_PLL1FRA & RCU_PLL1FRA_PLL1FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL1FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

